In [13]:
import pandas as pd
import numpy as np

In [14]:
# User specific variables
file_name = "Student List"
remove_cols = ['Column1', 'Column2'] # columns that need to be dropped, leave list empty if not required
questions_count_total = 10 # total number of questions to choose from
questions_count = 5 # number to questions students will answer

In [15]:
df = pd.read_csv(file_name+".csv")
student_count_total = df.shape[0] # total number of students
df.head()

         ID             Name  Column1  Column2
0  16101110      James Smith      NaN      NaN
1  16201130  Maria Rodriguez      NaN      NaN
2  17101119         John Doe      NaN      NaN
3  17101108    Miles Morales      NaN      NaN
4  18101110       Clark Kent      NaN      NaN

In [16]:
df.dtypes

ID           int64
Name        object
Column1    float64
Column2    float64
dtype: object

In [17]:
# Drop unwanted columns
df = df.drop(remove_cols, axis=1)

In [18]:
# Shuffle rows
df = df.sample(frac=1)
df.head()

         ID             Name
3  17101108    Miles Morales
1  16201130  Maria Rodriguez
0  16101110      James Smith
4  18101110       Clark Kent
2  17101119         John Doe

In [19]:
# Create list containing question numbers
questions = []
for i in range(1,questions_count_total):
    questions.append(i)

# Generating combinations
import itertools
combinations_total = []
combinations_count = 0
for subset in itertools.combinations(questions, questions_count):
        combinations_total.append(subset)
        combinations_count = combinations_count+1

# Making new list containing required number of combinations from all possible combinations
combinations_required = []
for i in range(0,combinations_count,round(combinations_count/student_count_total)):
    combinations_required.append(combinations_total[i])

In [20]:
# Create new column
col_name = "Questions"
df[col_name] = ""

# Add question numbers to dataframe
for index, row in df.iterrows():
    df.at[index, col_name] = combinations_required[index]

In [21]:
df.head()

         ID             Name        Questions
3  17101108    Miles Morales  (2, 3, 4, 6, 8)
1  16201130  Maria Rodriguez  (1, 2, 5, 6, 7)
0  16101110      James Smith  (1, 2, 3, 4, 5)
4  18101110       Clark Kent  (2, 5, 6, 7, 8)
2  17101119         John Doe  (1, 3, 5, 8, 9)

In [22]:
# Sort rows by ID
df = df.sort_values(by=['ID'])
df.head()

         ID             Name        Questions
0  16101110      James Smith  (1, 2, 3, 4, 5)
1  16201130  Maria Rodriguez  (1, 2, 5, 6, 7)
3  17101108    Miles Morales  (2, 3, 4, 6, 8)
2  17101119         John Doe  (1, 3, 5, 8, 9)
4  18101110       Clark Kent  (2, 5, 6, 7, 8)

In [23]:
df.to_csv(file_name+" Question Numbers.csv", index=False)